app/views/students/new.html.erb

SELECT "school_classes".* FROM "school_classes"
---
      <h3>Add Class Selection</h3>
      <p><%= f.collection_select :school_class_id, SchoolClass.all, :id, :title%></p>