app/controllers/students_controller.rb

  def create
    @student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at", "school_class_id") VALUES (?, ?, ?, ?, ?)  [["first_name", "Kim"], ["last_name", "Heidorn"], ["created_at", "2019-03-19 18:45:55.290220"], ["updated_at", "2019-03-19 18:45:55.290220"], ["school_class_id", 1]]